{
  "flashcards": [
    {
      "id": 1,
      "front": "What is a vector in linear algebra?",
      "back": "A vector is an ordered list of numbers and is often used to represent points in space or directions.",
      "lastModified": "2023-12-20T12:30:45.123Z",
      "status": "Want to Learn"
    },
    {
      "id": 2,
      "front": "Define a matrix.",
      "back": "A matrix is a two-dimensional array of numbers, symbols, or expressions arranged in rows and columns.",
      "lastModified": "2023-12-15T09:15:30.567Z",
      "status": "Learned"
    },
    {
      "id": 3,
      "front": "What is the determinant of a matrix?",
      "back": "The determinant is a scalar value that can be calculated from the elements of a square matrix and provides important information about the matrix's properties.",
      "lastModified": "2023-12-18T16:55:20.789Z",
      "status": "Noted"
    },
    {
      "id": 5,
      "front": "What is a linear transformation?",
      "back": "A linear transformation is a mapping between two vector spaces that preserves vector addition and scalar multiplication. It is a fundamental concept in linear algebra.",
      "lastModified": "2023-12-22T08:45:55.456Z",
      "status": "Learned"
    },
    {
      "id": 6,
      "front": "Define the term 'span' in the context of linear algebra.",
      "back": "The span of a set of vectors is the set of all possible linear combinations of those vectors. It represents all the points that can be reached by scaling and adding the vectors in the set.",
      "lastModified": "2023-12-14T11:10:35.678Z",
      "status": "Noted"
    },
    {
      "id": 9,
      "front": "Define the cross product of two vectors.",
      "back": "The cross product of two vectors in three-dimensional space is a vector that is perpendicular to both of them. It is used in various applications, including calculating the area of parallelograms and determining the direction of a vector perpendicular to a plane defined by two other vectors.",
      "lastModified": "2023-12-23T15:30:25.678Z",
      "status": "Noted"
    },
    {
      "id": 10,
      "front": "What is a symmetric matrix?",
      "back": "A symmetric matrix is a square matrix that is equal to its transpose. The elements across the main diagonal are mirrored in a symmetric matrix.",
      "lastModified": "2023-12-19T17:40:50.987Z",
      "status": "Want to Learn"
    },
    {
      "id": 12,
      "front": "What is the rank of a matrix? What is the rank of a matrix? What is the rank of a matrix? What is the rank of a matrix?",
      "back": "The rank of a matrix is the maximum number of linearly independent rows or columns in the matrix. It provides information about the dimensionality of the vector space spanned by the matrix's rows or columns.",
      "lastModified": "2023-12-30T17:00:24.510Z",
      "status": "Noted"
    },
    {
      "id": 13,
      "front": "Define the term 'eigendecomposition.'",
      "back": "Eigendecomposition is the process of decomposing a matrix into a canonical form, whereby the matrix is represented as a product of eigenvalues and eigenvectors.",
      "lastModified": "2023-12-21T14:10:55.789Z",
      "status": "Want to Learn"
    },
    {
      "id": 14,
      "front": "What is the trace of a matrix?",
      "back": "The trace of a square matrix is the sum of its diagonal elements. It is a useful quantity in various mathematical applications and is invariant under similarity transformations.",
      "lastModified": "2023-12-30T17:13:21.033Z",
      "status": "Want to Learn"
    },
    {
      "id": 15,
      "front": "Explain the concept of a linearly independent set of vectors.",
      "back": "A set of vectors is linearly independent if no vector in the set can be written as a linear combination of the others. In other words, none of the vectors in the set is redundant.",
      "lastModified": "2023-12-25T16:20:15.567Z",
      "status": "Noted"
    },
    {
      "id": 16,
      "front": "What is a basis for a vector space?",
      "back": "A basis for a vector space is a set of linearly independent vectors that span the entire vector space. Any vector in the space can be expressed as a linear combination of the basis vectors.",
      "lastModified": "2023-12-24T12:05:30.876Z",
      "status": "Want to Learn"
    },
    {
      "id": 17,
      "front": "front",
      "back": "back",
      "lastModified": "2023-12-30T17:01:49.055Z",
      "status": "Want to Learn"
    }
  ]
}