{
  "flashcards": [
    {
      "id": 1,
      "front": "What is a vector in linear algebra?",
      "back": "A vector is an ordered list of numbers and is often used to represent points in space or directions.",
      "lastModified": "2023-12-15T08:45:32.124Z",
      "status": "Noted"
    },
    {
      "id": 2,
      "front": "Define matrix multiplication.",
      "back": "Matrix multiplication is a binary operation that takes two matrices and produces another matrix, representing the composition of linear transformations.",
      "lastModified": "2023-12-18T14:20:56.789Z",
      "status": "Want to Learn"
    },
    {
      "id": 3,
      "front": "What is the determinant of a matrix?",
      "back": "The determinant is a scalar value that can be calculated from the elements of a square matrix. It provides important information about the matrix properties.",
      "lastModified": "2023-12-20T09:37:41.502Z",
      "status": "Learned"
    },
    {
      "id": 4,
      "front": "Explain the concept of eigenvectors and eigenvalues.",
      "back": "Eigenvectors are non-zero vectors that only change by a scalar factor when a linear transformation is applied. Eigenvalues are the corresponding scalar factors.",
      "lastModified": "2023-12-21T17:12:09.231Z",
      "status": "Noted"
    },
    {
      "id": 5,
      "front": "What is the rank of a matrix?",
      "back": "The rank of a matrix is the maximum number of linearly independent row vectors or column vectors in the matrix.",
      "lastModified": "2023-12-23T11:54:28.875Z",
      "status": "Want to Learn"
    },
    {
      "id": 6,
      "front": "Define linear independence of vectors.",
      "back": "Vectors are linearly independent if no vector in the set is a combination of the others, i.e., no vector can be written as a linear combination of the remaining vectors.",
      "lastModified": "2023-12-25T06:28:14.367Z",
      "status": "Learned"
    },
    {
      "id": 7,
      "front": "Explain the concept of a subspace.",
      "back": "A subspace of a vector space is a set of vectors that is closed under vector addition and scalar multiplication. It is itself a vector space.",
      "lastModified": "2023-12-27T13:45:52.846Z",
      "status": "Noted"
    },
    {
      "id": 8,
      "front": "What is a linear transformation?",
      "back": "A linear transformation is a function between two vector spaces that preserves vector addition and scalar multiplication.",
      "lastModified": "2023-12-29T20:09:37.124Z",
      "status": "Want to Learn"
    },
    {
      "id": 9,
      "front": "Define the null space of a matrix.",
      "back": "The null space (kernel) of a matrix consists of all vectors that, when multiplied by the matrix, result in the zero vector.",
      "lastModified": "2023-12-31T09:22:43.567Z",
      "status": "Learned"
    },
    {
      "id": 10,
      "front": "Explain the concept of orthogonality.",
      "back": "Vectors or subspaces are orthogonal if they are perpendicular, meaning their dot product is zero.",
      "lastModified": "2024-01-01T14:58:26.789Z",
      "status": "Noted"
    },
    {
      "id": 11,
      "front": "What is the cross product of two vectors?",
      "back": "The cross product is a binary operation on two vectors in three-dimensional space, producing a third vector that is perpendicular to the plane containing the input vectors.",
      "lastModified": "2024-01-02T18:30:19.402Z",
      "status": "Want to Learn"
    },
    {
      "id": 12,
      "front": "Define the concept of a basis in linear algebra.",
      "back": "A basis is a set of vectors that spans the vector space, and the vectors are linearly independent.",
      "lastModified": "2024-01-03T11:14:37.621Z",
      "status": "Learned"
    },
    {
      "id": 13,
      "front": "Explain the concept of a singular matrix.",
      "back": "A square matrix is singular if its determinant is zero, and it does not have a unique solution in the system of linear equations it represents.",
      "lastModified": "2024-01-01T21:26:14.703Z",
      "status": "Noted"
    },
    {
      "id": 14,
      "front": "What is the transpose of a matrix?",
      "back": "The transpose of a matrix is obtained by swapping its rows with columns. If the matrix is denoted by A, the transpose is represented as A^T.",
      "lastModified": "2023-12-15T08:45:32.124Z",
      "status": "Want to Learn"
    },
    {
      "id": 15,
      "front": "Define the term eigenspace.",
      "back": "The eigenspace associated with a specific eigenvalue is the set of all corresponding eigenvectors, along with the zero vector.",
      "lastModified": "2023-12-18T14:20:56.789Z",
      "status": "Learned"
    },
    {
      "id": 16,
      "front": "What is a diagonal matrix?",
      "back": "A diagonal matrix is a square matrix in which all off-diagonal elements are zero, and only the diagonal elements are non-zero.",
      "lastModified": "2023-12-20T09:37:41.502Z",
      "status": "Noted"
    },
    {
      "id": 17,
      "front": "Explain the concept of row reduction (Gaussian elimination).",
      "back": "Row reduction is a systematic method to transform a matrix into its row-echelon or reduced row-echelon form, simplifying systems of linear equations.",
      "lastModified": "2023-12-21T17:12:09.231Z",
      "status": "Want to Learn"
    },
    {
      "id": 18,
      "front": "Define the term linearly dependent vectors.",
      "back": "Vectors are linearly dependent if one vector in a set can be written as a linear combination of the others.",
      "lastModified": "2023-12-23T11:54:28.875Z",
      "status": "Learned"
    },
    {
      "id": 19,
      "front": "What is the inverse of a matrix?",
      "back": "The inverse of a square matrix A is denoted as A^-1 and, when multiplied by A, results in the identity matrix.",
      "lastModified": "2023-12-25T06:28:14.367Z",
      "status": "Noted"
    },
    {
      "id": 20,
      "front": "Explain the concept of a vector space.",
      "back": "A vector space is a set of vectors along with rules for vector addition and scalar multiplication, satisfying specific properties.",
      "lastModified": "2023-12-27T13:45:52.846Z",
      "status": "Want to Learn"
    },
    {
      "id": 21,
      "front": "What is the determinant of an orthogonal matrix?",
      "back": "The determinant of an orthogonal matrix is always ±1, as the columns are orthonormal, and the matrix preserves lengths and angles.",
      "lastModified": "2023-12-29T20:09:37.124Z",
      "status": "Learned"
    },
    {
      "id": 22,
      "front": "Define the concept of a span in linear algebra.",
      "back": "The span of a set of vectors is the set of all possible linear combinations of those vectors.",
      "lastModified": "2023-12-31T09:22:43.567Z",
      "status": "Noted"
    },
    {
      "id": 23,
      "front": "Explain the concept of a homogeneous system of linear equations.",
      "back": "A system of linear equations is homogeneous if all the constant terms are zero.",
      "lastModified": "2024-01-01T14:58:26.789Z",
      "status": "Want to Learn"
    },
    {
      "id": 24,
      "front": "What is the dot product of two vectors?",
      "back": "The dot product is a binary operation that takes two equal-length sequences of numbers and returns a single number, representing the scalar product of the vectors.",
      "lastModified": "2024-01-02T18:30:19.402Z",
      "status": "Learned"
    },
    {
      "id": 25,
      "front": "Define the term orthogonal complement.",
      "back": "The orthogonal complement of a subspace V is the set of all vectors in the vector space that are orthogonal to every vector in V.",
      "lastModified": "2024-01-03T11:14:37.621Z",
      "status": "Noted"
    },
    {
      "id": 26,
      "front": "Explain the concept of the characteristic equation.",
      "back": "The characteristic equation is a polynomial equation det(A - λI) = 0, where A is a square matrix, λ is an eigenvalue, and I is the identity matrix.",
      "lastModified": "2023-12-15T08:45:32.124Z",
      "status": "Want to Learn"
    },
    {
      "id": 27,
      "front": "What is a Hermitian matrix?",
      "back": "A Hermitian matrix is a complex square matrix that is equal to its own conjugate transpose, i.e., A^H = A, where H denotes the conjugate transpose.",
      "lastModified": "2023-12-18T14:20:56.789Z",
      "status": "Learned"
    },
    {
      "id": 28,
      "front": "Define the concept of a linearly independent set.",
      "back": "A set of vectors is linearly independent if no vector in the set can be written as a linear combination of the others.",
      "lastModified": "2023-12-20T09:37:41.502Z",
      "status": "Noted"
    },
    {
      "id": 29,
      "front": "Explain the concept of the column space of a matrix.",
      "back": "The column space of a matrix is the span of its column vectors and represents all possible linear combinations of those columns.",
      "lastModified": "2023-12-21T17:12:09.231Z",
      "status": "Want to Learn"
    },
    {
      "id": 30,
      "front": "What is the adjugate of a matrix?",
      "back": "The adjugate (or adjoint) of a matrix is the transpose of its cofactor matrix and is used to find the inverse of a non-singular matrix.",
      "lastModified": "2023-12-23T11:54:28.875Z",
      "status": "Learned"
    },
    {
      "id": 31,
      "front": "Define the term symmetric matrix.",
      "back": "A symmetric matrix is a square matrix that is equal to its transpose, i.e., A^T = A.",
      "lastModified": "2023-12-25T06:28:14.367Z",
      "status": "Noted"
    },
    {
      "id": 32,
      "front": "Explain the concept of the Frobenius norm.",
      "back": "The Frobenius norm of a matrix is the square root of the sum of the squares of its elements.",
      "lastModified": "2023-12-27T13:45:52.846Z",
      "status": "Want to Learn"
    },
    {
      "id": 33,
      "front": "What is the spectral theorem in linear algebra?",
      "back": "The spectral theorem states that for any symmetric matrix, there exists an orthogonal matrix that diagonalizes it.",
      "lastModified": "2023-12-29T20:09:37.124Z",
      "status": "Learned"
    },
    {
      "id": 34,
      "front": "Define the concept of a square matrix.",
      "back": "A square matrix has an equal number of rows and columns.",
      "lastModified": "2023-12-31T09:22:43.567Z",
      "status": "Noted"
    },
    {
      "id": 35,
      "front": "Explain the concept of the singular value decomposition (SVD).",
      "back": "The SVD decomposes a matrix into the product of three matrices: U, Σ, and V^T, providing insights into the matrix's properties and structure.",
      "lastModified": "2024-01-01T14:58:26.789Z",
      "status": "Want to Learn"
    }
  ]
}